slides/HW5-Data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HW5-Data</title>
<!-- 2014-09-25 Thu 23:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Jim Blomo"/>
<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">HW5-Data</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Homework &amp; Project</a>
<ul>
<li><a href="#sec-1-1">1.1. Yes, Project &amp; HW</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Homework</a>
<ul>
<li><a href="#sec-2-1">2.1. Tasks with Telnet</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Lab will discuss details</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Extra Credit</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Homework &amp; Project&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> Homework </dt><dd>Use telnet to send data with <code>GET</code>, <code>POST</code>, <code>PUT</code>. Set correct
    <code>Content-Type</code> for an image
</dd>
</dl>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Yes, Project &amp; HW&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Homeworks will continue while you work on projects
</li>
<li>Homeworks will emphasis week's lesson
</li>
<li>Projects will bring them together
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Homework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-bash">cd webarch2013
git checkout master
git pull jblomo master
git push origin master
git checkout -b hw5-data
./server/app.py
</pre>
</div>
<p>
<a href="http://people.ischool.berkeley.edu/~jblomo/server/">http://people.ischool.berkeley.edu/~jblomo/server/</a>
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Tasks with Telnet&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>What HTTP command is used to make the <code>/home</code> resource respond with your full name (including spaces), the title
of the page should be the full title of this class.
</li>
<li>Use a PUT request to set the redirect target of <a href="http://people.ischool.berkeley.edu/">http://people.ischool.berkeley.edu/</a>~&lt;USER&gt;/server/wiki 
<ol class="org-ol">
<li>How do you verify this change?
</li>
</ol>
</li>
<li>Use a POST to update the redirect target of <a href="http://people.ischool.berkeley.edu/">http://people.ischool.berkeley.edu/</a>~&lt;USER&gt;/server/wiki to a another new location.
</li>
<li>Update <code>app.py</code> to correctly return an image from  <a href="http://people.ischool.berkeley.edu/">http://people.ischool.berkeley.edu/</a>~&lt;USER&gt;/server/i253
<ul class="org-ul">
<li>Use your browser to test
</li>
<li>Including the <code>Content-Type</code> in your submission
</li>
</ul>
</li>
</ol>
</div>
<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Lab will discuss details&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h4>
<div class="outline-text-4" id="text-2-1-1">
<ul class="org-ul">
<li>We'll go over <code>app.py</code>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Extra Credit&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Modify <code>app.py</code> to return either an image or text based on the request's
     <code>Accept</code> header
</li>
</ul>


<script type="text/javascript" src="production/org-html-slideshow.js"></script>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jim Blomo</p>
<p class="date">Created: 2014-09-25 Thu 23:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
